---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.CircleUnbounded
source: html/d3eeab1b-3e4a-7973-5f2f-ac31e9d1045c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.CircleUnbounded Property

An unbounded circle can only be used to construct a spiral shape.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircleUnbounded { get; }
```